In [77]:
import psycopg2
import pandas as pd

def run(query):
    conn = psycopg2.connect(database = 'diskusi_kel4', user = "postgres", password = 'maftuh2003', host = "localhost", port = "5432")
    cur = conn.cursor()
#     cur.execute(query)
#     return cur.fetchall()
    return pd.read_sql(query, conn)

# 1. Prepare a list of offices sorted by country, state, city

In [78]:
query = "SELECT * FROM _offices ORDER BY country, state, city;"
run(query)

,officecode,city,phone,addressline1,addressline2,state,country,postalcode,territory
0,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
1,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA
2,5,Tokyo,+81 33 224 5000,4-1 Kioicho,,Chiyoda-Ku,Japan,102-8578,Japan
3,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,,UK,EC2N 1HN,EMEA
4,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
5,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
6,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA

# 2. How many employees are there in the company?

In [79]:
query = "SELECT COUNT(employeenumber) FROM _employees"
run(query)

   count
0     23

# 3. What is the total of payments received?

In [80]:
run(
'''
SELECT SUM (amount) FROM _payments
'''
)

          sum
0  8853839.23

# 4. List the product lines that contain 'Cars'.

In [81]:
query = '''
    SELECT * FROM _productlines
    WHERE productline LIKE '%Cars%';
'''
run(query)

,productline,textdescription,htmldescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,,
1,Vintage Cars,Our Vintage Car models realistically portray a...,,

# 5. Report total payments for October 28, 2004

In [82]:
query = '''
    SELECT SUM(amount) FROM _payments
    WHERE paymentdate <= '2004-10-28';
'''
run(query)

          sum
0  5887073.03

# 6. Report those payments greater than 100000

In [83]:
query = '''
    SELECT * FROM _payments
    WHERE amount >= 100000;
'''
run(query)

   customernumber checknumber paymentdate     amount
0             124    AE215433  2005-03-05  101244.59
1             124    KI131716  2003-08-15  111654.40
2             141     ID10962  2004-12-31  116208.40
3             141    JE105477  2005-03-18  120166.58
4             148    KM172879  2003-12-26  105743.00

# 7. List the products in each product line

In [85]:
query = '''
    SELECT productname, productline FROM _products
'''
run(query)

                               productname   productline
0    1969 Harley Davidson Ultimate Chopper   Motorcycles
1                 1952 Alpine Renault 1300  Classic Cars
2                    1996 Moto Guzzi 1100i   Motorcycles
3     2003 Harley-Davidson Eagle Drag Bike   Motorcycles
4                      1972 Alfa Romeo GTA  Classic Cars
..                                     ...           ...
105                     F/A 18 Hornet 1/72        Planes
106                            The Titanic         Ships
107                         The Queen Mary         Ships
108              American Airlines: MD-11S        Planes
109                             Pont Yacht         Ships

[110 rows x 2 columns]

# 8. How many products in each product line?

In [86]:
query = '''
    SELECT productline, COUNT(productCode) FROM _products GROUP BY productline
'''
run(query)

        productline  count
0      Classic Cars     38
1            Trains      3
2            Planes     12
3  Trucks and Buses     11
4      Vintage Cars     24
5       Motorcycles     13
6             Ships      9

# 9. What is the minimum payment received?

In [87]:
query = '''
    SELECT min(amount) FROM _payments
'''
run(query)

      min
0  615.45

# 10. Which orders have a value greater than 5,000?

In [91]:
query = '''
    SELECT ordernumber, productcode, quantityordered*priceeach as value 
    FROM _orderdetails 
    WHERE quantityordered * priceeach > 5000
'''
run(query)

     ordernumber productcode     value
0          10103    S10_1949   5571.80
1          10103    S10_4962   5026.14
2          10105    S10_4757   6392.00
3          10105    S12_1108   8434.52
4          10105    S24_2011   5072.71
..           ...         ...       ...
405        10421    S18_2795   5847.10
406        10424    S10_1949  10072.00
407        10424    S12_1666   5960.36
408        10424    S18_1097   5859.00
409        10425    S24_2300   6261.71

[410 rows x 3 columns]